Autodesk.Revit.DB.DialogOptions.DialogOptionsBase.SetParentHwnd(System.IntPtr)
setParentHwnd
Since:
2027

Autodesk.Revit.DB.DialogOptions.DialogOptionsBase.GetParentHwnd
getParentHwnd
Since:
2027

Autodesk.Revit.DB.DialogOptions.DialogOptionsBase.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.DialogOptions.DialogOptionsBase.WindowTitle
caption in window title bar
Since:
2027

Autodesk.Revit.DB.DialogOptions.DialogOptionsBase.DialogIdDescriptor
Unique Id/Name of dialog
Since:
2027

Autodesk.Revit.DB.DialogOptions.DialogOptionsBase.HelpId
Integer number of ResourceId for help hyperlink
Since:
2027

Autodesk.Revit.DB.DialogOptions.DialogOptionsBase
This class is the base for all dialogs' options as the input for ManagedCallEventArgs.
Since:
2027